SlugSat/3HC/3HC_Firmware/3HC_Firmware_0_1.cydsn/Generated_Source/PSoC5/TIMER_UI_UPDATE.c
        /* Exit Critical Region*/
        CyExitCriticalSection(TIMER_UI_UPDATE_interruptState);

        #if (TIMER_UI_UPDATE_EnableTriggerMode)
            TIMER_UI_UPDATE_EnableTrigger();
        #endif /* Set Trigger enable bit for UDB implementation in the control register*/
		
		
        #if (TIMER_UI_UPDATE_InterruptOnCaptureCount && !TIMER_UI_UPDATE_UDB_CONTROL_REG_REMOVED)
            TIMER_UI_UPDATE_SetInterruptCount(TIMER_UI_UPDATE_INIT_INT_CAPTURE_COUNT);
        #endif /* Set interrupt count in UDB implementation if interrupt count feature is checked.*/

        TIMER_UI_UPDATE_ClearFIFO();
    #endif /* Configure additional features of UDB implementation */

    TIMER_UI_UPDATE_SetInterruptMode(TIMER_UI_UPDATE_INIT_INTERRUPT_MODE);
}


/*******************************************************************************
* Function Name: TIMER_UI_UPDATE_Enable
********************************************************************************
*
* Summary:
*  Enable the Timer
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_UI_UPDATE_Enable(void) 
{
    /* Globally Enable the Fixed Function Block chosen */
    #if (TIMER_UI_UPDATE_UsingFixedFunction)
        TIMER_UI_UPDATE_GLOBAL_ENABLE |= TIMER_UI_UPDATE_BLOCK_EN_MASK;
        TIMER_UI_UPDATE_GLOBAL_STBY_ENABLE |= TIMER_UI_UPDATE_BLOCK_STBY_EN_MASK;
    #endif /* Set Enable bit for enabling Fixed function timer*/

    /* Remove assignment if control register is removed */
    #if (!TIMER_UI_UPDATE_UDB_CONTROL_REG_REMOVED || TIMER_UI_UPDATE_UsingFixedFunction)
        TIMER_UI_UPDATE_CONTROL |= TIMER_UI_UPDATE_CTRL_ENABLE;
    #endif /* Remove assignment if control register is removed */
}


/*******************************************************************************
* Function Name: TIMER_UI_UPDATE_Start
********************************************************************************
*
* Summary:
*  The start function initializes the timer with the default values, the
*  enables the timerto begin counting.  It does not enable interrupts,
*  the EnableInt command should be called if interrupt generation is required.
*
* Parameters:
*  void
*
* Return:
*  void
*
* Global variables:
*  TIMER_UI_UPDATE_initVar: Is modified when this function is called for the
*   first time. Is used to ensure that initialization happens only once.
*
*******************************************************************************/
void TIMER_UI_UPDATE_Start(void) 
{
    if(TIMER_UI_UPDATE_initVar == 0u)
    {
        TIMER_UI_UPDATE_Init();

        TIMER_UI_UPDATE_initVar = 1u;   /* Clear this bit for Initialization */
    }

    /* Enable the Timer */
    TIMER_UI_UPDATE_Enable();
}


/*******************************************************************************
* Function Name: TIMER_UI_UPDATE_Stop
********************************************************************************
*
* Summary:
*  The stop function halts the timer, but does not change any modes or disable
*  interrupts.
*
* Parameters:
*  void
*
* Return:
*  void
*
* Side Effects: If the Enable mode is set to Hardware only then this function
*               has no effect on the operation of the timer.
*
*******************************************************************************/
void TIMER_UI_UPDATE_Stop(void) 
{
    /* Disable Timer */
    #if(!TIMER_UI_UPDATE_UDB_CONTROL_REG_REMOVED || TIMER_UI_UPDATE_UsingFixedFunction)
        TIMER_UI_UPDATE_CONTROL &= ((uint8)(~TIMER_UI_UPDATE_CTRL_ENABLE));
    #endif /* Remove assignment if control register is removed */

    /* Globally disable the Fixed Function Block chosen */
    #if (TIMER_UI_UPDATE_UsingFixedFunction)
        TIMER_UI_UPDATE_GLOBAL_ENABLE &= ((uint8)(~TIMER_UI_UPDATE_BLOCK_EN_MASK));
        TIMER_UI_UPDATE_GLOBAL_STBY_ENABLE &= ((uint8)(~TIMER_UI_UPDATE_BLOCK_STBY_EN_MASK));
    #endif /* Disable global enable for the Timer Fixed function block to stop the Timer*/
}


/*******************************************************************************
* Function Name: TIMER_UI_UPDATE_SetInterruptMode
********************************************************************************
*
* Summary:
*  This function selects which of the interrupt inputs may cause an interrupt.
*  The twosources are caputure and terminal.  One, both or neither may
*  be selected.
*
* Parameters:
*  interruptMode:   This parameter is used to enable interrups on either/or
*                   terminal count or capture.
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_UI_UPDATE_SetInterruptMode(uint8 interruptMode) 
{
    TIMER_UI_UPDATE_STATUS_MASK = interruptMode;
}


/*******************************************************************************
* Function Name: TIMER_UI_UPDATE_SoftwareCapture
********************************************************************************
*
* Summary:
*  This function forces a capture independent of the capture signal.
*
* Parameters:
*  void
*
* Return:
*  void
*
* Side Effects:
*  An existing hardware capture could be overwritten.
*
*******************************************************************************/
void TIMER_UI_UPDATE_SoftwareCapture(void) 
{
    /* Generate a software capture by reading the counter register */
    #if(TIMER_UI_UPDATE_UsingFixedFunction)
        (void)CY_GET_REG16(TIMER_UI_UPDATE_COUNTER_LSB_PTR);
    #else
        (void)CY_GET_REG8(TIMER_UI_UPDATE_COUNTER_LSB_PTR_8BIT);
    #endif/* (TIMER_UI_UPDATE_UsingFixedFunction) */
    /* Capture Data is now in the FIFO */
}


/*******************************************************************************
* Function Name: TIMER_UI_UPDATE_ReadStatusRegister
********************************************************************************
*
* Summary:
*  Reads the status register and returns it's state. This function should use
*  defined types for the bit-field information as the bits in this register may
*  be permuteable.
*
* Parameters:
*  void
*
* Return:
*  The contents of the status register
*
* Side Effects:
*  Status register bits may be clear on read.
*
*******************************************************************************/
uint8   TIMER_UI_UPDATE_ReadStatusRegister(void) 
{
    return (TIMER_UI_UPDATE_STATUS);
}


#if (!TIMER_UI_UPDATE_UDB_CONTROL_REG_REMOVED) /* Remove API if control register is unused */


