SlugSat/3HC/3HC_Firmware/3HC_Firmware_0_1.cydsn/Generated_Source/PSoC5/TIMER_UI_UPDATE.c
/*******************************************************************************
 * The functions below this point are only available using the UDB
 * implementation.  If a feature is selected, then the API is enabled.
 ******************************************************************************/


#if (TIMER_UI_UPDATE_SoftwareCaptureMode)


/*******************************************************************************
* Function Name: TIMER_UI_UPDATE_SetCaptureMode
********************************************************************************
*
* Summary:
*  This function sets the capture mode to either rising or falling edge.
*
* Parameters:
*  captureMode: This parameter sets the capture mode of the UDB capture feature
*  The parameter values are defined using the
*  #define TIMER_UI_UPDATE__B_TIMER__CM_NONE 0
#define TIMER_UI_UPDATE__B_TIMER__CM_RISINGEDGE 1
#define TIMER_UI_UPDATE__B_TIMER__CM_FALLINGEDGE 2
#define TIMER_UI_UPDATE__B_TIMER__CM_EITHEREDGE 3
#define TIMER_UI_UPDATE__B_TIMER__CM_SOFTWARE 4
 identifiers
*  The following are the possible values of the parameter
*  TIMER_UI_UPDATE__B_TIMER__CM_NONE        - Set Capture mode to None
*  TIMER_UI_UPDATE__B_TIMER__CM_RISINGEDGE  - Rising edge of Capture input
*  TIMER_UI_UPDATE__B_TIMER__CM_FALLINGEDGE - Falling edge of Capture input
*  TIMER_UI_UPDATE__B_TIMER__CM_EITHEREDGE  - Either edge of Capture input
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_UI_UPDATE_SetCaptureMode(uint8 captureMode) 
{
    /* This must only set to two bits of the control register associated */
    captureMode = ((uint8)((uint8)captureMode << TIMER_UI_UPDATE_CTRL_CAP_MODE_SHIFT));
    captureMode &= (TIMER_UI_UPDATE_CTRL_CAP_MODE_MASK);

    #if (!TIMER_UI_UPDATE_UDB_CONTROL_REG_REMOVED)
        /* Clear the Current Setting */
        TIMER_UI_UPDATE_CONTROL &= ((uint8)(~TIMER_UI_UPDATE_CTRL_CAP_MODE_MASK));

        /* Write The New Setting */
        TIMER_UI_UPDATE_CONTROL |= captureMode;
    #endif /* (!TIMER_UI_UPDATE_UDB_CONTROL_REG_REMOVED) */
}
#endif /* Remove API if Capture Mode is not Software Controlled */


#if (TIMER_UI_UPDATE_SoftwareTriggerMode)


/*******************************************************************************
* Function Name: TIMER_UI_UPDATE_SetTriggerMode
********************************************************************************
*
* Summary:
*  This function sets the trigger input mode
*
* Parameters:
*  triggerMode: Pass one of the pre-defined Trigger Modes (except Software)
    #define TIMER_UI_UPDATE__B_TIMER__TM_NONE 0x00u
    #define TIMER_UI_UPDATE__B_TIMER__TM_RISINGEDGE 0x04u
    #define TIMER_UI_UPDATE__B_TIMER__TM_FALLINGEDGE 0x08u
    #define TIMER_UI_UPDATE__B_TIMER__TM_EITHEREDGE 0x0Cu
    #define TIMER_UI_UPDATE__B_TIMER__TM_SOFTWARE 0x10u
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_UI_UPDATE_SetTriggerMode(uint8 triggerMode) 
{
    /* This must only set to two bits of the control register associated */
    triggerMode &= TIMER_UI_UPDATE_CTRL_TRIG_MODE_MASK;

    #if (!TIMER_UI_UPDATE_UDB_CONTROL_REG_REMOVED)   /* Remove assignment if control register is removed */
    
        /* Clear the Current Setting */
        TIMER_UI_UPDATE_CONTROL &= ((uint8)(~TIMER_UI_UPDATE_CTRL_TRIG_MODE_MASK));

        /* Write The New Setting */
        TIMER_UI_UPDATE_CONTROL |= (triggerMode | TIMER_UI_UPDATE__B_TIMER__TM_SOFTWARE);
    #endif /* Remove code section if control register is not used */
}
#endif /* Remove API if Trigger Mode is not Software Controlled */

#if (TIMER_UI_UPDATE_EnableTriggerMode)


/*******************************************************************************
* Function Name: TIMER_UI_UPDATE_EnableTrigger
********************************************************************************
*
* Summary:
*  Sets the control bit enabling Hardware Trigger mode
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_UI_UPDATE_EnableTrigger(void) 
{
    #if (!TIMER_UI_UPDATE_UDB_CONTROL_REG_REMOVED)   /* Remove assignment if control register is removed */
        TIMER_UI_UPDATE_CONTROL |= TIMER_UI_UPDATE_CTRL_TRIG_EN;
    #endif /* Remove code section if control register is not used */
}


/*******************************************************************************
* Function Name: TIMER_UI_UPDATE_DisableTrigger
********************************************************************************
*
* Summary:
*  Clears the control bit enabling Hardware Trigger mode
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_UI_UPDATE_DisableTrigger(void) 
{
    #if (!TIMER_UI_UPDATE_UDB_CONTROL_REG_REMOVED )   /* Remove assignment if control register is removed */
        TIMER_UI_UPDATE_CONTROL &= ((uint8)(~TIMER_UI_UPDATE_CTRL_TRIG_EN));
    #endif /* Remove code section if control register is not used */
}
#endif /* Remove API is Trigger Mode is set to None */

#if(TIMER_UI_UPDATE_InterruptOnCaptureCount)


/*******************************************************************************
* Function Name: TIMER_UI_UPDATE_SetInterruptCount
********************************************************************************
*
* Summary:
*  This function sets the capture count before an interrupt is triggered.
*
* Parameters:
*  interruptCount:  A value between 0 and 3 is valid.  If the value is 0, then
*                   an interrupt will occur each time a capture occurs.
*                   A value of 1 to 3 will cause the interrupt
*                   to delay by the same number of captures.
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_UI_UPDATE_SetInterruptCount(uint8 interruptCount) 
{
    /* This must only set to two bits of the control register associated */
    interruptCount &= TIMER_UI_UPDATE_CTRL_INTCNT_MASK;

