SlugSat/3HC/3HC_Firmware/3HC_Firmware_0_1.cydsn/Generated_Source/PSoC5/TIMER_UI_UPDATE.c
    #if (!TIMER_UI_UPDATE_UDB_CONTROL_REG_REMOVED)
        /* Clear the Current Setting */
        TIMER_UI_UPDATE_CONTROL &= ((uint8)(~TIMER_UI_UPDATE_CTRL_INTCNT_MASK));
        /* Write The New Setting */
        TIMER_UI_UPDATE_CONTROL |= interruptCount;
    #endif /* (!TIMER_UI_UPDATE_UDB_CONTROL_REG_REMOVED) */
}
#endif /* TIMER_UI_UPDATE_InterruptOnCaptureCount */


#if (TIMER_UI_UPDATE_UsingHWCaptureCounter)


/*******************************************************************************
* Function Name: TIMER_UI_UPDATE_SetCaptureCount
********************************************************************************
*
* Summary:
*  This function sets the capture count
*
* Parameters:
*  captureCount: A value between 2 and 127 inclusive is valid.  A value of 1
*                to 127 will cause the interrupt to delay by the same number of
*                captures.
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_UI_UPDATE_SetCaptureCount(uint8 captureCount) 
{
    TIMER_UI_UPDATE_CAP_COUNT = captureCount;
}


/*******************************************************************************
* Function Name: TIMER_UI_UPDATE_ReadCaptureCount
********************************************************************************
*
* Summary:
*  This function reads the capture count setting
*
* Parameters:
*  void
*
* Return:
*  Returns the Capture Count Setting
*
*******************************************************************************/
uint8 TIMER_UI_UPDATE_ReadCaptureCount(void) 
{
    return ((uint8)TIMER_UI_UPDATE_CAP_COUNT);
}
#endif /* TIMER_UI_UPDATE_UsingHWCaptureCounter */


/*******************************************************************************
* Function Name: TIMER_UI_UPDATE_ClearFIFO
********************************************************************************
*
* Summary:
*  This function clears all capture data from the capture FIFO
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_UI_UPDATE_ClearFIFO(void) 
{
    while(0u != (TIMER_UI_UPDATE_ReadStatusRegister() & TIMER_UI_UPDATE_STATUS_FIFONEMP))
    {
        (void)TIMER_UI_UPDATE_ReadCapture();
    }
}

#endif /* UDB Specific Functions */


/* [] END OF FILE */
